In [64]:
import pandas as pd 

df1 = pd.DataFrame({'Salario': [30000, 45000, 38000],
                    'Antigüedad': [9, 13, 12]},
                   index=[1, 2, 3])
df2 = pd.DataFrame({'Ciudad': ['Madrid', 'Barcelona', 'Valencia'],
                    'Jerarquía': ['Baja', 'Alta', 'Media']},
                   index=[1, 4, 5])

In [65]:
df1

   Salario  Antigüedad
1    30000           9
2    45000          13
3    38000          12

In [66]:
df2

      Ciudad Jerarquía
1     Madrid      Baja
4  Barcelona      Alta
5   Valencia     Media

In [67]:
df_unido = df1.join(df2)
df_unido

   Salario  Antigüedad  Ciudad Jerarquía
1    30000           9  Madrid      Baja
2    45000          13     NaN       NaN
3    38000          12     NaN       NaN

In [68]:
dfunido2 = df1.join(df2, how = 'inner')
dfunido2

   Salario  Antigüedad  Ciudad Jerarquía
1    30000           9  Madrid      Baja

In [69]:
df3 = pd.DataFrame({'Nombre': ["Juan", "Gabriela", "Elena"], 'Edad': [23, 31, 21]})
df3

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21

In [70]:
df4 = pd.DataFrame({'Nombre': ["Carmela", "Max", "Laura"], 'Edad': [34, 25, 29]})
df4

    Nombre  Edad
0  Carmela    34
1      Max    25
2    Laura    29

In [71]:
df_concatenado = pd.concat([df3, df4])
df_concatenado

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21
0   Carmela    34
1       Max    25
2     Laura    29

In [74]:
df_concatenado2 = pd.concat([df3,df4], axis = 0)
df_concatenado2

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21
0   Carmela    34
1       Max    25
2     Laura    29

In [75]:
df_concatenado2 = pd.concat([df3,df4], axis = 1)
df_concatenado2

     Nombre  Edad   Nombre  Edad
0      Juan    23  Carmela    34
1  Gabriela    31      Max    25
2     Elena    21    Laura    29

In [80]:
df_concatenado3 = pd.concat([df3,df4], axis = 0, keys =['Tabla df3', 'Tabla df4'])
df_concatenado3

               Nombre  Edad
Tabla df3 0      Juan    23
          1  Gabriela    31
          2     Elena    21
Tabla df4 0   Carmela    34
          1       Max    25
          2     Laura    29